## Reshaping Data in Pandas

In [1]:
import pandas as pd
import os

In [2]:
train = pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/murder_2016/murder_2015_final.csv')

In [3]:
train.head()

         city     state  2014_murders  2015_murders  change
0   Baltimore  Maryland           211           344     133
1     Chicago  Illinois           411           478      67
2     Houston     Texas           242           303      61
3   Cleveland      Ohio            63           120      57
4  Washington      D.C.           105           162      57

### Gather variables into a single columns

In [5]:
melted = pd.melt(train, id_vars=["city","state","change"], 
                 var_name="Year", value_name="Murder_count")

In [13]:
melted['Year'] =  melted.Year.apply(lambda x: x[:4])

### Arrange data alphabetically by state and city

In [7]:
melted.sort_values(by=['state','city'],ascending=[True,True],inplace=True)

In [8]:
melted.head()

          city    state  change  Year  Murder_count
75      Mobile  Alabama      -7  2014            31
158     Mobile  Alabama      -7  2015            24
20   Anchorage   Alaska      14  2014            12
103  Anchorage   Alaska      14  2015            26
53    Chandler  Arizona       0  2014             1

### Convert so that Year is in columns

In [9]:
melted2 = melted.pivot_table(index=['state','city','change'],columns='Year',values='Murder_count').reset_index()

In [10]:
melted2.head()

Year    state       city  change  2014  2015
0     Alabama     Mobile      -7    31    24
1      Alaska  Anchorage      14    12    26
2     Arizona   Chandler       0     1     1
3     Arizona       Mesa       3    13    16
4     Arizona    Phoenix      -2   114   112

In [11]:
melted['city_state'] = melted.state + "_" + melted.city

In [12]:
melted.head()

          city    state  change  Year  Murder_count        city_state
75      Mobile  Alabama      -7  2014            31    Alabama_Mobile
158     Mobile  Alabama      -7  2015            24    Alabama_Mobile
20   Anchorage   Alaska      14  2014            12  Alaska_Anchorage
103  Anchorage   Alaska      14  2015            26  Alaska_Anchorage
53    Chandler  Arizona       0  2014             1  Arizona_Chandler